InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омВзаимодействиеСерверПовтор/Ext/Module.bsl
Функция ПолучитьНАстройкиОтправкиСообщения() Экспорт

	ОбъектОбщиеНастройки = Отчеты.ОбщиеНастройки.Создать();

	
	мСписокИмен = Новый Массив;
	
	мСписокИмен.Добавить(ОбъектОбщиеНастройки.ПолучитьИмяУчетнаяЗаписьОтправкиСообщения());    
	мСписокИмен.Добавить(ОбъектОбщиеНастройки.ПолучитьИмяТемаОтправкиСообщения());    
	мСписокИмен.Добавить(ОбъектОбщиеНастройки.ПолучитьИмяШаблонОтправкиТекстаСообщения()); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПроекта.Значение КАК Значение,
	|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", мСписокИмен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КореньПДМ = "";
	
	СписокНастроек = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокНастроек.Добавить(Выборка.Значение, Выборка.ИмяНастройки);	
	КонецЦикла; 
	
	Возврат СписокНастроек;
	
КонецФункции // ПолучитьНАстройкиОтправкиСообщения()
